In [1]:
import pandas as pd
import numpy as np

In [2]:
symbol=['JD','APPL']
data={'行业':['电商','科技'],
     '价格':[25.95,172.97],
     '交易量':[27113291,18913154]}
df=pd.DataFrame(data,index=symbol)
df.columns.name='特征' #列索引
df.index.name='代号'   #行索引
df

特征    行业      价格       交易量
代号
JD    电商   25.95  27113291
APPL  科技  172.97  18913154

stack:列索引-行索引

df变成两层序列

In [3]:
c2i_Series=df.stack()
c2i_Series

代号    特征
JD    行业           电商
      价格        25.95
      交易量    27113291
APPL  行业           科技
      价格       172.97
      交易量    18913154
dtype: object

unstack:行索引-列索引

内外层差别

In [4]:
i2c_Series=df.unstack()
i2c_Series

特征   代号
行业   JD            电商
     APPL          科技
价格   JD         25.95
     APPL      172.97
交易量  JD      27113291
     APPL    18913154
dtype: object

In [5]:
df.index,df.columns

(Index(['JD', 'APPL'], dtype='object', name='代号'),
 Index(['行业', '价格', '交易量'], dtype='object', name='特征'))

In [6]:
c2i_Series.index

MultiIndex(levels=[['JD', 'APPL'], ['行业', '价格', '交易量']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=['代号', '特征'])

In [7]:
i2c_Series.index

MultiIndex(levels=[['行业', '价格', '交易量'], ['JD', 'APPL']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['特征', '代号'])

In [8]:
c2i_Series

代号    特征
JD    行业           电商
      价格        25.95
      交易量    27113291
APPL  行业           科技
      价格       172.97
      交易量    18913154
dtype: object

In [9]:
c2i_Series.index

MultiIndex(levels=[['JD', 'APPL'], ['行业', '价格', '交易量']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=['代号', '特征'])

unstack没有层数，默认为最后一层

In [11]:
c2i_Series.unstack()

特征    行业      价格       交易量
代号
JD    电商   25.95  27113291
APPL  科技  172.97  18913154

In [12]:
c2i_Series.unstack(0)

代号         JD      APPL
特征
行业         电商        科技
价格      25.95    172.97
交易量  27113291  18913154

In [13]:
c2i_Series.unstack('代号')

代号         JD      APPL
特征
行业         电商        科技
价格      25.95    172.97
交易量  27113291  18913154

含2层行索引，1层列索引的数据帧

In [ ]:
data=[['电商',101550,176.92],
     ['电商',175336,25.95],
     ['金融',60348,41.79],
     ['金融',36600,196.00]]
midx=pd.MultiIndex(levels=[['中国','美国'],
                           ['BABA','JD','GS','MS']],
                   codes=[[0,0,1,1],[0,1,2,3]],
                  names=['地区','代号'])
mcol=pd.Index(['行业','雇员','价格'],name='特征')
df=pd.DataFrame(data,index=midx,columns=mcol)
df

长宽互转

In [26]:
data=pd.read_csv('C:\\Users\\usere\\Desktop\\SPY.csv',parse_dates=[0],dayfirst=True)
data

           Date    Adj_Close  Adj_Volume
0    1993-01-29    28.223927     1003200
1    1993-02-01    28.424666      480500
2    1993-02-02          NaN      201300
3    1993-02-03    28.785997      529400
4    1993-02-04    28.906440      531500
5    1993-02-05    28.886334      492100
6    1993-02-08    28.886334      596100
7    1993-02-09    28.685595      122100
8    1993-02-10    28.725743      379600
9    1993-02-11    28.866292       19500
10   1993-02-12    28.645447       42500
11   1993-02-16    27.922786      374800
12   1993-02-17    27.902744      210900
13   1993-02-18    27.882638      378100
14   1993-02-19    27.983040       34900
15   1993-02-22    28.083377      513600
16   1993-02-23    28.063336      373700
17   1993-02-24    28.424666       26300
18   1993-02-25    28.484856       44500
19   1993-02-26    28.525004       66200
20   1993-03-01    28.444708       66500
21   1993-03-02    28.866292      182400
22   1993-03-03    28.986736      280100
23   1993-03-04    28.826144       89500
24   1993-03-05    28.745849       40000
25   1993-03-08    29.388214       50800
26   1993-03-09    29.287812      169300
27   1993-03-10    29.348066      194400
28   1993-03-11    29.267771       70900
29   1993-03-12    28.966630      643600
...         ...          ...         ...
6319 2018-03-05   271.105597    97307387
6320 2018-03-06   271.792848    78407902
6321 2018-03-07   271.693247    87063502
6322 2018-03-08   273.007988    66901150
6323 2018-03-09   277.758984   113625335
6324 2018-03-12   277.410379    71852943
6325 2018-03-13   275.617550    91903263
6326 2018-03-14   274.203207   105895079
6327 2018-03-15   273.904402    83433038
6328 2018-03-16   274.200000   100343673
6329 2018-03-19   270.490000   109208442
6330 2018-03-20   270.950000    59757271
6331 2018-03-21   270.430000    78709578
6332 2018-03-22   263.670000   148785916
6333 2018-03-23   258.050000   183534751
6334 2018-03-26   265.110000   141956102
6335 2018-03-27   260.600000   129941445
6336 2018-03-28   259.830000   146452306
6337 2018-03-29   263.150000   124244790
6338 2018-04-02   257.470000   186286343
6339 2018-04-03   260.770000   119889222
6340 2018-04-04   263.560000   123574054
6341 2018-04-05   265.640000    80993290
6342 2018-04-06   259.720000   179483634
6343 2018-04-09   261.000000   105442932
6344 2018-04-10   265.150000   105383213
6345 2018-04-11   263.760000    91082611
6346 2018-04-12          NaN    68648611
6347 2018-04-13  2651.500000    85043940
6348 2018-04-16   267.330000    63354866

[6349 rows x 3 columns]

对于旧表数据帧df,用它若干列标签作为新表的index、columns、values

pd.pivot=(index=df_col_label_1,columns=df_col_label_2,values=df_col_label_3)

In [ ]:
close_price=data.pivot(index='Date',columns='Sumbol',values='Adj Close')
close_price

In [ ]:
data.pivot(index='Date',columns='Symbol',values=['Adj Close','Volume'])

melt()函数实际将旧表转化为id-variable类型的数据帧

In [ ]:
melted_data=pd.melt(price_df,id_vars=['Symbol'])
melted_data.head(5).append(melted_data.tail(5))

In [ ]:
melted_data=pd.melt(price_df,id_vars=['Symbol'],var_name='OHLCV',value_name='Value')
melted_data.head(5).append(melted_data.tail(5))

In [ ]:
melted_data=pd.melt(price_df,id_vars=['Data','Symbol'],var_name='OHLCV',value_name='Value')
melted_data.head(5).append(melted_data.tail(5))

数据分析

In [27]:
data.describe()

         Adj_Close    Adj_Volume
count  6347.000000  6.349000e+03
mean    108.171940  8.439630e+07
std      64.541711  1.003193e+08
min      27.882638  5.200000e+03
25%      73.212058  6.405600e+06
50%      97.311651  5.469196e+07
75%     124.149164  1.250593e+08
max    2651.500000  8.710263e+08

In [29]:
data.corr()

            Adj_Close  Adj_Volume
Adj_Close    1.000000    0.232506
Adj_Volume   0.232506    1.000000

transform

In [30]:
people=pd.DataFrame(np.random.randn(5,5),columns=list('abcde'),index=['Joe','Steve','Wes','Jim','Travis'])
people

               a         b         c         d         e
Joe     0.073973 -0.309852  2.280568  0.396707  0.005210
Steve  -0.223299 -1.324099 -0.350161  1.656904 -0.826031
Wes    -0.191647 -1.175084  0.471405 -1.006328  0.832946
Jim    -0.862339 -0.775075 -1.012267  0.849138  0.260961
Travis -1.206861  0.227902  0.773058 -1.456306  0.010327

In [32]:
df=pd.DataFrame({'key1':list('ababa'),
                 'key2':['one','two','one','two','one'],
                'data1':np.random.randn(5),
                'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.782700 -1.299684
1    b  two -1.727478 -2.030433
2    a  one  1.863008  1.277376
3    b  two  1.124835 -0.223958
4    a  one -0.102967 -0.695412

In [42]:
grouped=df['data1'].groupby(df['key1'])
grouped.mean()

key1
a   -0.007553
b   -0.301322
Name: data1, dtype: float64

In [43]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])
years=np.array([2005,2005,2006,2005,2006])

In [48]:
df['data1'].groupby([states,years]).mean()

California  2005   -1.727478
            2006    1.863008
Ohio        2005   -0.328933
            2006   -0.102967
Name: data1, dtype: float64

In [49]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.007553 -0.239240
b    -0.301322 -1.127195

对分组进行迭代

In [50]:
for name,group in df.groupby('key1'):
    print(name,group)

a   key1 key2     data1     data2
0    a  one -1.782700 -1.299684
2    a  one  1.863008  1.277376
4    a  one -0.102967 -0.695412
b   key1 key2     data1     data2
1    b  two -1.727478 -2.030433
3    b  two  1.124835 -0.223958

In [52]:
#转化为字典
piece=dict(list(df.groupby('key1')))
piece

{'a':   key1 key2     data1     data2
 0    a  one -1.782700 -1.299684
 2    a  one  1.863008  1.277376
 4    a  one -0.102967 -0.695412, 'b':   key1 key2     data1     data2
 1    b  two -1.727478 -2.030433
 3    b  two  1.124835 -0.223958}

In [54]:
value=piece['a']
value

  key1 key2     data1     data2
0    a  one -1.782700 -1.299684
2    a  one  1.863008  1.277376
4    a  one -0.102967 -0.695412

In [55]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [59]:
grouped=df.groupby(df.dtypes,axis=1)
value=dict(list(grouped))
value

{dtype('float64'):       data1     data2
 0 -1.782700 -1.299684
 1 -1.727478 -2.030433
 2  1.863008  1.277376
 3  1.124835 -0.223958
 4 -0.102967 -0.695412, dtype('O'):   key1 key2
 0    a  one
 1    b  two
 2    a  one
 3    b  two
 4    a  one}

In [61]:
#对df进行'key1'，'key2'的两次分组，然后取data2的数据，对两次细分的分组数据取均值
value=df.groupby(['key1','key2'])[['data2']].mean()
value

              data2
key1 key2
a    one  -0.239240
b    two  -1.127195

In [62]:
df.groupby('key1').transform(np.mean)

      data1     data2
0 -0.007553 -0.239240
1 -0.301322 -1.127195
2 -0.007553 -0.239240
3 -0.301322 -1.127195
4 -0.007553 -0.239240

In [64]:
rng=np.random.RandomState(0)
df=pd.DataFrame({'key':list('ABCABC'),'data1':range(6),'data2':rng.randint(0,10,6)})
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [67]:
grouped=df.groupby('key')
value=dict(list(grouped))
print(value)

{'A':   key  data1  data2
0   A      0      5
3   A      3      3, 'B':   key  data1  data2
1   B      1      0
4   B      4      7, 'C':   key  data1  data2
2   C      2      3
5   C      5      9}

In [68]:
for (key,group) in grouped:
    print(key)
    print(group)

A
  key  data1  data2
0   A      0      5
3   A      3      3
B
  key  data1  data2
1   B      1      0
4   B      4      7
C
  key  data1  data2
2   C      2      3
5   C      5      9

In [69]:
grouped.apply(sum)

    key  data1  data2
key
A    AA      3      8
B    BB      5      7
C    CC      7     12

In [70]:
import pandas as pd
import numpy as np
def odd(num):
    return (num%2)==0
data=pd.DataFrame(np.arange(21).reshape(3,7),columns=list('ABCDEFG'))
print("第一种分组结果：")
for key,group in data.groupby(odd):#相当于依据data的索引值在odd函数上的运行结果作为分类标准
    print(key)
    print(group)
print("第二种分组结果：")
for key,group in data.groupby(odd(data['B'])):#相当于依据B列在odd函数的运行结果作为分类标准
    print(key)
    print(group)

第一种分组结果：
False
   A  B  C   D   E   F   G
1  7  8  9  10  11  12  13
True
    A   B   C   D   E   F   G
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
第二种分组结果：
False
    A   B   C   D   E   F   G
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
True
   A  B  C   D   E   F   G
1  7  8  9  10  11  12  13

In [71]:
import pandas as pd
import numpy as np
def odd(num):
    return int(num)%2==0
data=pd.DataFrame(np.arange(20).reshape(4,5),index=list('1234'),columns=list('12345'))
print("原始数据：")
print(data)
data_axis0=data.groupby(odd,axis=0)#默认依据index在odd上的运行结果进行分组
print("按axis=0进行分组结果如下：")
for key,group in data_axis0:
    print(key)
    print(group)
data_axis1=data.groupby(odd,axis=1)#默认依据column在odd上的运行结果进行分组
print("按axis=1进行分组结果如下：")
for key,group in data_axis1:
    print(key)
    print(group)

原始数据：
    1   2   3   4   5
1   0   1   2   3   4
2   5   6   7   8   9
3  10  11  12  13  14
4  15  16  17  18  19
按axis=0进行分组结果如下：
False
    1   2   3   4   5
1   0   1   2   3   4
3  10  11  12  13  14
True
    1   2   3   4   5
2   5   6   7   8   9
4  15  16  17  18  19
按axis=1进行分组结果如下：
False
    1   3   5
1   0   2   4
2   5   7   9
3  10  12  14
4  15  17  19
True
    2   4
1   1   3
2   6   8
3  11  13
4  16  18

聚合默认是在axis=0轴进行的

代码中的date_list中的每个元素按照顺序与dataframe中的记录一一对应

In [72]:
import pandas as pd
import numpy as np
data=pd.DataFrame(np.arange(30).reshape(5,6),index=list('12345'),columns=list('ABCDEF'))
print(data)
date_list=[2004,2005,2006,2005,2004]
data_1=data.groupby(date_list)
print("分组结果如下：")
for key,group in data_1:
    print(key)
    print(group)

    A   B   C   D   E   F
1   0   1   2   3   4   5
2   6   7   8   9  10  11
3  12  13  14  15  16  17
4  18  19  20  21  22  23
5  24  25  26  27  28  29
分组结果如下：
2004
    A   B   C   D   E   F
1   0   1   2   3   4   5
5  24  25  26  27  28  29
2005
    A   B   C   D   E   F
2   6   7   8   9  10  11
4  18  19  20  21  22  23
2006
    A   B   C   D   E   F
3  12  13  14  15  16  17

axis=0 按行分组

axis=1 按列分组

In [73]:
import pandas as pd
import numpy as np
data=pd.DataFrame(np.arange(20).reshape(4,5),index=list('1234'),columns=list('12345'))
by_dict={'1':'red','2':'yellow','3':'yellow','4':'black','5':'white'}
by_dict1={'1':'red','2':'yellow','3':'yellow','5':'white'}
data_1=data.groupby(by_dict)
print("按by_dict分组的结果：")
for key,group in data_1:
    print(key)
    print(group)
data_2=data.groupby(by_dict1)
print("按by_dict1分组的结果：")
data_3=data.groupby(by_dict1)
for key,group in data_3:
    print(key)
    print(group)

按by_dict分组的结果：
black
    1   2   3   4   5
4  15  16  17  18  19
red
   1  2  3  4  5
1  0  1  2  3  4
yellow
    1   2   3   4   5
2   5   6   7   8   9
3  10  11  12  13  14
按by_dict1分组的结果：
red
   1  2  3  4  5
1  0  1  2  3  4
yellow
    1   2   3   4   5
2   5   6   7   8   9
3  10  11  12  13  14

以上这些聚合方法都会排除每个分组内的NaN值

自定义聚合

agg() 或者 aggregate()

In [75]:
#返回一个随机整型数，范围从低（包括）到高（不包括），即[low, high)
df1=pd.DataFrame({
    'Data1':np.random.randint(0,10,5),
    'Data2':np.random.randint(10,20,5),
    'key1':list('aabba'),
    'key2':list('xyyxy')
})
def peak_range(df):
    print(df)
    return df.max()-df.min()
df1.groupby('key1').agg(peak_range)

0    5
1    6
4    4
Name: Data1, dtype: int32
2    4
3    2
Name: Data1, dtype: int32
0    18
1    14
4    18
Name: Data2, dtype: int32
2    11
3    18
Name: Data2, dtype: int32
0    x
1    y
4    y
Name: key2, dtype: object
0    x
1    y
4    y
Name: key2, dtype: object
0    x
1    y
4    y
Name: a, dtype: object
0    x
1    y
4    y
Name: a, dtype: object

      Data1  Data2
key1
a         2      4
b         2      7

pd.qcut是等样本数，pd.cut是等值区间分，groupby和pd.cut和pd.qcut结合使用，可以对等值或等样本数分组后的结果进行分析

In [86]:
frame=pd.DataFrame({'data1':np.random.randn(1000),
                   'data2':np.random.randn(1000)})
frame.head()

      data1     data2
0 -0.051800 -0.831499
1  0.207728 -0.400902
2 -0.947919 -1.273579
3 -0.724176  1.099069
4 -1.385208 -0.362478

In [79]:
quariles=pd.cut(frame.data1,4)
quariles[:10]

0    (-1.763, 0.00582]
1     (0.00582, 1.775]
2    (-1.763, 0.00582]
3     (-3.539, -1.763]
4    (-1.763, 0.00582]
5    (-1.763, 0.00582]
6     (0.00582, 1.775]
7    (-1.763, 0.00582]
8     (0.00582, 1.775]
9    (-1.763, 0.00582]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.539, -1.763] < (-1.763, 0.00582] < (0.00582, 1.775] < (1.775, 3.544]]

In [80]:
quriles_1 = pd.qcut(frame.data1,4)
quriles_1[:10]

0    (-0.743, -0.0716]
1       (0.598, 3.544]
2     (-3.533, -0.743]
3     (-3.533, -0.743]
4    (-0.743, -0.0716]
5     (-3.533, -0.743]
6     (-0.0716, 0.598]
7     (-0.0716, 0.598]
8     (-0.0716, 0.598]
9    (-0.743, -0.0716]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.533, -0.743] < (-0.743, -0.0716] < (-0.0716, 0.598] < (0.598, 3.544]]

In [81]:
def get(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}

In [82]:
frame.data2.groupby(quariles).apply(get)

data1
(-3.539, -1.763]   count     44.000000
                   max        2.001056
                   mean       0.020093
                   min       -2.120239
(-1.763, 0.00582]  count    488.000000
                   max        2.987252
                   mean      -0.014376
                   min       -2.423425
(0.00582, 1.775]   count    436.000000
                   max        3.299682
                   mean       0.071963
                   min       -2.841280
(1.775, 3.544]     count     32.000000
                   max        2.325723
                   mean       0.178789
                   min       -1.269346
Name: data2, dtype: float64

In [83]:
frame.data2.groupby(quariles).apply(get).unstack()

                   count       max      mean       min
data1
(-3.539, -1.763]    44.0  2.001056  0.020093 -2.120239
(-1.763, 0.00582]  488.0  2.987252 -0.014376 -2.423425
(0.00582, 1.775]   436.0  3.299682  0.071963 -2.841280
(1.775, 3.544]      32.0  2.325723  0.178789 -1.269346

In [84]:
# 去掉分组数值lable,采用默认的0开始的索引
q=pd.cut(frame.data1,10,labels=False)
df.data2.groupby(q).apply(get).unstack()

       count  max  mean  min
data1
2        1.0  3.0   3.0  3.0
3        2.0  9.0   6.0  3.0
4        2.0  7.0   6.0  5.0
6        1.0  0.0   0.0  0.0

In [85]:
df = pd.DataFrame({'key1':list('aabbe'),
                   'key2':['one', 'two', 'one', 'two', 'one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})
print(df)

  key1 key2     data1     data2
0    a  one -0.751791 -0.354788
1    a  two  0.343733 -1.560326
2    b  one -1.399751  0.811260
3    b  two -1.143035 -0.465153
4    e  one -1.016001  1.026423

In [87]:
# 常用聚合函数用引号即可引用
df.groupby(['key1','key2']).agg('mean')

              data1     data2
key1 key2
a    one  -0.751791 -0.354788
     two   0.343733 -1.560326
b    one  -1.399751  0.811260
     two  -1.143035 -0.465153
e    one  -1.016001  1.026423

In [88]:
df.groupby(['key1','key2']).agg(['mean','std','sum','count'])

              data1                         data2
               mean std       sum count      mean std       sum count
key1 key2
a    one  -0.751791 NaN -0.751791     1 -0.354788 NaN -0.354788     1
     two   0.343733 NaN  0.343733     1 -1.560326 NaN -1.560326     1
b    one  -1.399751 NaN -1.399751     1  0.811260 NaN  0.811260     1
     two  -1.143035 NaN -1.143035     1 -0.465153 NaN -0.465153     1
e    one  -1.016001 NaN -1.016001     1  1.026423 NaN  1.026423     1

函数名会默认为分组后的列名，如果想改列名，传入二元元组

In [93]:
df.groupby(['key1','key2']).agg([('foo','mean'),('haha','std')])

              data1          data2
                foo haha       foo haha
key1 key2
a    one  -0.751791  NaN -0.354788  NaN
     two   0.343733  NaN -1.560326  NaN
b    one  -1.399751  NaN  0.811260  NaN
     two  -1.143035  NaN -0.465153  NaN
e    one  -1.016001  NaN  1.026423  NaN

不同列用不同函数，用agg({‘列名1’：[‘函数名1’,‘函数名2,…],‘列名2’:[‘函数名2’,…]

In [94]:
df.groupby(['key1','key2']).agg({'data1':['max','min','std'],
                                'data2':['sum','count']})

              data1                   data2
                max       min std       sum count
key1 key2
a    one  -0.751791 -0.751791 NaN -0.354788     1
     two   0.343733  0.343733 NaN -1.560326     1
b    one  -1.399751 -1.399751 NaN  0.811260     1
     two  -1.143035 -1.143035 NaN -0.465153     1
e    one  -1.016001 -1.016001 NaN  1.026423     1

apply与agg相同点：

都可以对分组后的结果进行运算


apply与agg不同点：

① agg只能对单列，apply可以对多列进行；

② apply可以使用匿名函数,agg不行

In [95]:
def top(df,n=2,column='data1'):
    return df.sort_values(by=column)[-n:]
df.groupby('key1').apply(top)

       key1 key2     data1     data2
key1
a    0    a  one -0.751791 -0.354788
     1    a  two  0.343733 -1.560326
b    2    b  one -1.399751  0.811260
     3    b  two -1.143035 -0.465153
e    4    e  one -1.016001  1.026423

In [96]:
df.groupby('key2').apply(top,n=3,column='data2')

       key1 key2     data1     data2
key2
one  0    a  one -0.751791 -0.354788
     2    b  one -1.399751  0.811260
     4    e  one -1.016001  1.026423
two  1    a  two  0.343733 -1.560326
     3    b  two -1.143035 -0.465153

In [100]:
data=np.array([[1,2,3],[4,5,6]])
idx=['mouse','rabbit']
cols=['one','two','three']
df=pd.DataFrame(data,index=idx,columns=cols)
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [101]:
df.filter(items=['one','three'])

        one  three
mouse     1      3
rabbit    4      6

In [102]:
df.filter(['one','three'])

        one  three
mouse     1      3
rabbit    4      6

lambda

In [103]:
g=lambda x,y:x+y
g(4,6)

10

filter

In [106]:
import math
def add(x):
    return math.sqrt(x)%1==0
list(filter(add,range(1,101)))

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

map

In [109]:
def add(x):
    return x+5
list(map(add,range(1,10)))

[6, 7, 8, 9, 10, 11, 12, 13, 14]

In [114]:
df = pd.DataFrame({'key1':list('aabbe'),
                   'key2':['one', 'two', 'one', 'two', 'one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})
print(df)

  key1 key2     data1     data2
0    a  one  0.010648  0.450186
1    a  two -0.077697  1.072488
2    b  one -1.537139  0.053031
3    b  two -0.935719  1.191869
4    e  one  1.286296 -0.511814

In [127]:
aabb=df.groupby('key1')
value=dict(list(aabb))
print(value)

{'a':   key1 key2     data1     data2
0    a  one  0.010648  0.450186
1    a  two -0.077697  1.072488, 'b':   key1 key2     data1     data2
2    b  one -1.537139  0.053031
3    b  two -0.935719  1.191869, 'e':   key1 key2     data1     data2
4    e  one  1.286296 -0.511814}

In [128]:
aabb.ngroups

3

In [129]:
aabb.size()

key1
a    2
b    2
e    1
dtype: int64

In [130]:
aabb.groups

{'a': Int64Index([0, 1], dtype='int64'),
 'b': Int64Index([2, 3], dtype='int64'),
 'e': Int64Index([4], dtype='int64')}

In [131]:
aabb.get_group('b').head()

  key1 key2     data1     data2
2    b  one -1.537139  0.053031
3    b  two -0.935719  1.191869

transform()函数转换和原数据形状一样